In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("./messy_data.csv", encoding='latin-1',sep=';')

In [4]:
df.head()

,IMBD title ID,Original titlÊ,Release year,Genrë¨,Duration,Country,Content Rating,Director,Unnamed: 8,Income,Votes,Score
0,tt0111161,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,NaN,$ 28815245,2.278.845,9.3
1,tt0068646,The Godfather,09 21 1972,"Crime, Drama",175,USA,R,Francis Ford Coppola,NaN,$ 246120974,1.572.674,9.2
2,tt0468569,The Dark Knight,23 -07-2008,"Action, Crime, Drama",152,US,PG-13,Christopher Nolan,NaN,$ 1005455211,2.241.615,9.
3,tt0071562,The Godfather: Part II,1975-09-25,"Crime, Drama",220,USA,R,Francis Ford Coppola,NaN,"$ 4o8,035,783",1.098.714,"9,.0"
4,tt0110912,Pulp Fiction,1994-10-28,"Crime, Drama",,USA,R,Quentin Tarantino,NaN,$ 222831817,1.780.147,"8,9f"

In [5]:
df.tail()

,IMBD title ID,Original titlÊ,Release year,Genrë¨,Duration,Country,Content Rating,Director,Unnamed: 8,Income,Votes,Score
96,tt0070735,The Sting,1974-03-21,"Comedy, Crime, Drama",129,USA,PG,George Roy Hill,NaN,$ 156000000,236.285,7.5
97,tt0082096,Das Boot,1982-03-18,"Adventure, Drama, Thriller",149,West Germany,R,Wolfgang Petersen,NaN,$ 11487676,226.427,7.5
98,tt0059578,Per qualche dollaro in piÃ¹,1965-12-20,Western,132,Italy,NaN,Sergio Leone,NaN,$ 15000000,226.039,7.4
99,tt1832382,Jodaeiye Nader az Simin,2011-10-21,Drama,123,Iran,PG-13,Asghar Farhadi,NaN,$ 22926076,214.165,7.4
100,tt0045152,Singin' in the Rain,1953-02-05,"Comedy, Musical, Romance",103,USA,NaN,Stanley Donen,NaN,$ 1864182,213.152,7.4

In [6]:
df.shape

(101, 12)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   IMBD title ID   100 non-null    object
 1   Original titlÊ  100 non-null    object
 2   Release year    100 non-null    object
 3   Genrë¨          100 non-null    object
 4   Duration        99 non-null     object
 5   Country         100 non-null    object
 6   Content Rating  77 non-null     object
 7   Director        100 non-null    object
 8   Unnamed: 8      0 non-null      float64
 9   Income          100 non-null    object
 10   Votes          100 non-null    object
 11  Score           100 non-null    object
dtypes: float64(1), object(11)
memory usage: 9.6+ KB

In [8]:
df.drop(['Unnamed: 8'], axis=1, inplace=True)

In [9]:
# rename and convert all column names to lowercase, remove trailing spaces and replace spaces with undescore

df.rename(columns= lambda x: x.strip().lower().replace(" ", "_"), inplace=True)
df.rename(columns = {'genrë¨': 'genre'}, inplace= True)
df.rename(columns = {'original_titlê': 'original_title'}, inplace= True)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   imbd_title_id   100 non-null    object
 1   original_title  100 non-null    object
 2   release_year    100 non-null    object
 3   genre           100 non-null    object
 4   duration        99 non-null     object
 5   country         100 non-null    object
 6   content_rating  77 non-null     object
 7   director        100 non-null    object
 8   income          100 non-null    object
 9   votes           100 non-null    object
 10  score           100 non-null    object
dtypes: object(11)
memory usage: 8.8+ KB

In [11]:
df['country'].value_counts()

USA             62
UK              12
Italy            4
Japan            4
France           3
South Korea      2
Germany          2
New Zesland      1
New Zealand      1
New Zeland       1
US.              1
Brazil           1
US               1
Italy1           1
India            1
Denmark          1
West Germany     1
Iran             1
Name: country, dtype: int64

In [12]:
df['country'].replace(['New Zesland', 'New Zeland', 'Italy1', 'US.', 'US', 'West Germany'], ['New Zealand', 'New Zealand', 
                                                                       'Italy', 'USA', 'USA', 'Germany'], inplace= True)
df['country'].value_counts()

USA            64
UK             12
Italy           5
Japan           4
New Zealand     3
France          3
Germany         3
South Korea     2
Brazil          1
India           1
Denmark         1
Iran            1
Name: country, dtype: int64

In [13]:
df['score'].value_counts()

8.6       11
8.2        8
8.3        8
8.1        7
8.4        7
8.5        6
7.5        6
7.8        6
8.0        6
7.9        5
7.6        4
7.7        4
7.4        3
8.8        3
8.7        2
8.9        2
9.2        1
8,6        1
8,7e-0     1
8.7.       1
++8.7      1
8:8        1
8..8       1
08.9       1
8,9f       1
9,.0       1
9.         1
9.3        1
Name: score, dtype: int64

In [14]:
df.replace(['8,6', '8,7e-0', '8.7.', '++8.7', '8:8', '8..8','08.9', '8,9f', '9,.0', '9.', '9.3'], 
           ['8.6', '8.7', '8.7', '8.7', '8.8', '8.8', '8.9', '8.9', '9.0', '9.0', '9.3'], inplace= True)

In [15]:
df['score'].value_counts()

8.6    12
8.3     8
8.2     8
8.4     7
8.1     7
7.5     6
8.5     6
8.0     6
7.8     6
8.8     5
8.7     5
7.9     5
7.7     4
8.9     4
7.6     4
7.4     3
9.0     2
9.2     1
9.3     1
Name: score, dtype: int64

In [16]:
df.query('score == "nan"')

Empty DataFrame
Columns: [imbd_title_id, original_title, release_year, genre, duration, country, content_rating, director, income, votes, score]
Index: []

In [17]:
# drop the row with "nan" score value from the dataset

df.drop(df.query('score == "nan"').index, inplace= True)

In [18]:
df['score'].value_counts()

# convert the datatype of score column from string to float
df['score'] = df['score'].astype('float')

In [19]:
df['votes'].value_counts()

2.278.845    1
349.642      1
928.036      1
941.683      1
1.049.009    1
            ..
1.308.193    1
307.958      1
388.310      1
470.931      1
213.152      1
Name: votes, Length: 100, dtype: int64

In [20]:
print(df[df['imbd_title_id'].isnull()])

   imbd_title_id original_title release_year genre duration country  \
13           NaN            NaN          NaN   NaN      NaN     NaN

   content_rating director income votes  score
13            NaN      NaN    NaN   NaN    NaN

In [21]:
df = df.dropna()

In [22]:
# replace dots with commas in the votes column and convert votes column to an integer datatype

df['votes'] = df['votes'].str.replace('.', '').astype(int)

c:\Users\ASUS\anaconda3\envs\my_env\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  This is separate from the ipykernel package so we can avoid doing imports until

In [23]:
# confirm that dots have been replaced with commas in the votes column values

df['votes'].value_counts()

2278845    1
591251     1
1049009    1
1229958    1
302317     1
          ..
626693     1
685856     1
1112336    1
1203825    1
214165     1
Name: votes, Length: 76, dtype: int64

In [24]:
# confirm datatype is successfully changed

df['votes'].dtype

dtype('int32')

In [25]:
# check row in duration column with blank value 
df[df['duration'] == " "]

,imbd_title_id,original_title,release_year,genre,duration,country,content_rating,director,income,votes,score
4,tt0110912,Pulp Fiction,1994-10-28,"Crime, Drama",,USA,R,Quentin Tarantino,$ 222831817,1780147,8.9

In [26]:
# replace the blank value with original duration

df['duration'] = df['duration'].replace([' '], 154)

# confirm the duration has been replaced successfully
df[df['duration'] == " "]

Empty DataFrame
Columns: [imbd_title_id, original_title, release_year, genre, duration, country, content_rating, director, income, votes, score]
Index: []

In [27]:
# replace the hyphen and Nan value with original duration

df.query('duration == "-"')
df['duration'] = df['duration'].replace({'-': 133, 'Nan': 195, ' ': 154, 'Inf': 139,
                                         '178c': 178, 'Not Applicable': 124})

# confirm the duration has been replaced successfully
df[df['duration'] == "-"]

Empty DataFrame
Columns: [imbd_title_id, original_title, release_year, genre, duration, country, content_rating, director, income, votes, score]
Index: []

In [28]:
# check if the values have been replaced successfully

print(df.query('duration == "Not Applicable"').empty)
print(df.query('duration == "Nan"').empty)
print(df.query('duration == "Inf"').empty)

True
True
True

In [29]:
# convert the duration column datatype from string to integer

df['duration'] = df['duration'].astype(int)

In [30]:
df['content_rating'].value_counts()

R            44
PG-13        12
PG           11
G             6
Not Rated     1
Approved      1
Unrated       1
Name: content_rating, dtype: int64

In [31]:
df['income'].value_counts()

$ 28815245     1
$ 91968688     1
$ 356296601    1
$ 321455689    1
$ 5472914      1
              ..
$ 355467056    1
$ 30680793     1
$ 286801374    1
$ 482349603    1
$ 22926076     1
Name: income, Length: 76, dtype: int64

In [32]:
#df['income'] = df['income'].astype(str)
#df['income'] = df['income'].str.replace('$', '').str.replace('o', '0').str.replace(',', '')

In [33]:
df['income'] = df['income'].replace({'\$': '', 'o': '0', ',': ''}, regex= True).str.strip()

In [34]:
# convert income column from string to integer data type

df['income'] = df['income'].astype(int)

# confirm income column datatype has been successfully changed
df['income'].dtype

dtype('int32')

In [35]:
df.describe(percentiles=[0.9, .95, .99])

         duration        income         votes      score
count   76.000000  7.600000e+01  7.600000e+01  76.000000
mean   139.131579  2.738499e+08  9.287982e+05   8.301316
std     33.051613  3.146542e+08  4.809663e+05   0.451514
min     81.000000  5.760000e+02  2.112500e+05   7.400000
50%    133.500000  1.257286e+08  8.904730e+05   8.300000
90%    178.500000  8.227770e+08  1.588477e+06   8.850000
95%    202.500000  9.777477e+08  1.786970e+06   8.925000
99%    228.250000  1.096418e+09  2.250922e+06   9.225000
max    229.000000  1.142271e+09  2.278845e+06   9.300000

In [36]:
# remove trailing spaces from values in original_title and director columns
df['original_title'] = df['original_title'].str.strip()

df['director'] = df['director'].str.strip()

Removing release dates that are out of range and replacing wrong date formats

In [37]:
df['release_year'].value_counts()

2000-05-19    2
1995-02-10    1
1979-12-18    1
2000-01-21    1
2009-10-02    1
             ..
2003-04-18    1
2003-05-09    1
2000-10-03    1
1998-10-30    1
2011-10-21    1
Name: release_year, Length: 75, dtype: int64

In [38]:
# remove trailing spaces from the release_year column

df['release_year'] = df['release_year'].str.strip()

In [39]:
# check for rows with release_year values that do not match the patter 'YYYY-MM-DD

#date_pattern = r'^((?!(\d{4}-\d{2}-\d{2})).)*$'

date_pattern = r'^((?!(\d{4}-\d{2}-\d{2})))'
#df['new'] = df.release_year.str.findall(date_pattern)
#df.filter(regex= date_pattern)
wrong_dates = df[df.release_year.str.match(date_pattern)]

In [40]:
wrong_dates

,imbd_title_id,original_title,release_year,genre,duration,country,content_rating,director,income,votes,score
1,tt0068646,The Godfather,09 21 1972,"Crime, Drama",175,USA,R,Francis Ford Coppola,246120974,1572674,9.2
2,tt0468569,The Dark Knight,23 -07-2008,"Action, Crime, Drama",152,USA,PG-13,Christopher Nolan,1005455211,2241615,9.0
5,tt0167260,The Lord of the Rings: The Return of the King,22 Feb 04,"Action, Adventure, Drama",201,New Zealand,PG-13,Peter Jackson,1142271098,1604280,8.9
9,tt0137523,Fight Club,10-29-99,Drama,139,UK,R,David Fincher,101218804,1807440,8.8
12,tt0060196,"Il buono, il brutto, il cattivo",23rd December of 1966,Western,161,Italy,Approved,Sergio Leone,25252481,672499,8.8
15,tt0167261,The Lord of the Rings: The Two Towers,01/16-03,"Action, Adventure, Drama",179,New Zealand,PG-13,Peter Jackson,951227416,1449778,8.7
18,tt0073486,One Flew Over the Cuckoo's Nest,18/11/1976,Drama,133,USA,R,Milos Forman,108997629,891071,8.7
45,tt0034583,Casablanca,21-11-46,"Drama, Romance, War",102,USA,PG,Michael Curtiz,4374761,509953,8.3

In [41]:
wrong_dates.index.to_list()

[1, 2, 5, 9, 12, 15, 18, 45]

In [42]:
# replace the dates with wrong formats

df.loc[wrong_dates.index.to_list(), 'release_year'] = wrong_dates['release_year'].replace({'09 21 1972': '1972-09-21', '23 -07-2008': '2008-07-23',
                                                 '22 Feb 04': '2004-02-22', '10-29-99': '1999-10-29', 
                                                 '23rd December of 1966': '1966-12-23', '01/16-03': '2003-01-16',
                                                 '18/11/1976': '1976-11-18', '21-11-46': '1946-11-21'})

# drop columns with dates that are out of range

df.drop(df.query('release_year == "1984-02-34"').index, inplace= True)
df.drop(df.query('release_year == "1976-13-24"').index, inplace= True)

df['release_year'].value_counts()

2000-05-19    2
1995-02-10    1
2000-01-21    1
1984-09-28    1
2007-04-06    1
             ..
2003-05-09    1
2000-10-03    1
1998-10-30    1
1977-10-20    1
2011-10-21    1
Name: release_year, Length: 73, dtype: int64

In [43]:
df[df.release_year.str.match(date_pattern)]

Empty DataFrame
Columns: [imbd_title_id, original_title, release_year, genre, duration, country, content_rating, director, income, votes, score]
Index: []

Alternative way to Remove release_dates that are out of range and replacing wrong date formats

In [44]:
# drop columns with dates that are out of range

df.drop(df.query('release_year == "1984-02-34"').index, inplace= True)
df.drop(df.query('release_year == "1976-13-24"').index, inplace= True)

In [45]:
df.query('release_year == "1976-13-24"')

Empty DataFrame
Columns: [imbd_title_id, original_title, release_year, genre, duration, country, content_rating, director, income, votes, score]
Index: []

In [46]:
# An alternative but inefficient way to Remove release_dates that are out of range and replacing wrong date formats is to
# convert the column to datetime datatype and correct date formats based on error raised and date formats rejected

#df['release_year'] = df['release_year'].replace({'09 21 1972': '1972-09-21', '23 -07-2008': '2008-07-23',
#                                                 '22 Feb 04': '2004-02-22', '10-29-99': '1999-10-29', 
#                                                 '23rd December of 1966': '1966-12-23', '01/16-03': '2003-01-16',
#                                                 '18/11/1976': '1976-11-18', '21-11-46': '1946-11-21'})

In [47]:
# convert release_year column from string to datetime datatype

df['release_year'] = pd.to_datetime(df['release_year'], format='%Y-%m-%d')

# create year column to hold only the year of release

df['year'] = pd.DatetimeIndex(df['release_year']).year

# convert year column to datetime
df['year'] = pd.to_datetime(df['year'])

# confirm datatype changed properly

df['release_year'].dtype

dtype('<M8[ns]')

In [48]:
#confirm year column is correctly created
df['year']

0    1970-01-01 00:00:00.000001995
1    1970-01-01 00:00:00.000001972
2    1970-01-01 00:00:00.000002008
3    1970-01-01 00:00:00.000001975
4    1970-01-01 00:00:00.000001994
                  ...
94   1970-01-01 00:00:00.000002012
95   1970-01-01 00:00:00.000001963
96   1970-01-01 00:00:00.000001974
97   1970-01-01 00:00:00.000001982
99   1970-01-01 00:00:00.000002011
Name: year, Length: 74, dtype: datetime64[ns]

In [49]:
# see the genres present in each row for each movie
genres_list = df['genre'].str.split(pat=',').explode().str.strip()
df['genre'].value_counts()

Drama                            8
Crime, Drama                     6
Action, Adventure, Drama         5
Action, Adventure, Fantasy       3
Biography, Drama, History        3
Crime, Drama, Thriller           3
Animation, Adventure, Family     2
Animation, Adventure, Comedy     2
Western                          2
Drama, Romance                   2
Action, Adventure, Sci-Fi        2
Action, Adventure                2
Comedy, Romance                  1
Comedy, Crime                    1
Drama, Western                   1
Adventure, Sci-Fi                1
Drama, Romance, Sci-Fi           1
Adventure, Drama, War            1
Adventure, Biography, Drama      1
Drama, Mystery, Thriller         1
Comedy                           1
Action, Drama, Mystery           1
Drama, Mystery, War              1
Comedy, Crime, Drama             1
Horror, Sci-Fi                   1
Drama, Horror                    1
Mystery, Thriller                1
Animation, Adventure, Fantasy    1
Drama, Music                     1
Comedy, Drama, Family            1
Drama, Family, Fantasy           1
Action, Crime, Drama             1
Biography, Crime, Drama          1
Adventure, Drama, Sci-Fi         1
Crime, Drama, Mystery            1
Drama, War                       1
Crime, Drama, Fantasy            1
Drama, Mystery, Sci-Fi           1
Drama, Romance, War              1
Adventure, Comedy, Sci-Fi        1
Action, Sci-Fi                   1
Crime, Mystery, Thriller         1
Animation, Adventure, Drama      1
Biography, Drama, Music          1
Horror, Mystery, Thriller        1
Adventure, Drama, Thriller       1
Name: genre, dtype: int64

In [50]:
# see unique genres in the dataframe
unique_genre_list = genres_list.unique().tolist()

unique_genre_list

['Drama',
 'Crime',
 'Action',
 'Adventure',
 'Biography',
 'History',
 'Sci-Fi',
 'Romance',
 'Western',
 'Fantasy',
 'Mystery',
 'Thriller',
 'War',
 'Animation',
 'Family',
 'Comedy',
 'Music',
 'Horror']

In [51]:
# one-hot encode the genre column
df_one_hot = pd.get_dummies(df['genre'].str.split(', ', expand=True).stack()).sum(level=0)

# join the one-hot encoded dataframe back to the original dataframe
df_one_hot = pd.concat([df, df_one_hot], axis=1)

# drop the genre column from the new dataframe
df_one_hot.drop('genre', axis=1, inplace=True)

# convert column names to lowercase and replace "-" with "_"
df_one_hot.rename(columns = lambda x: x.lower().replace("-", "_"), inplace=True)

df_one_hot.reset_index(inplace=True)

df_one_hot

c:\Users\ASUS\anaconda3\envs\my_env\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().

,index,imbd_title_id,original_title,release_year,duration,country,content_rating,director,income,votes,...,fantasy,history,horror,music,mystery,romance,sci_fi,thriller,war,western
0,0,tt0111161,The Shawshank Redemption,1995-02-10,142,USA,R,Frank Darabont,28815245,2278845,...,0,0,0,0,0,0,0,0,0,0
1,1,tt0068646,The Godfather,1972-09-21,175,USA,R,Francis Ford Coppola,246120974,1572674,...,0,0,0,0,0,0,0,0,0,0
2,2,tt0468569,The Dark Knight,2008-07-23,152,USA,PG-13,Christopher Nolan,1005455211,2241615,...,0,0,0,0,0,0,0,0,0,0
3,3,tt0071562,The Godfather: Part II,1975-09-25,220,USA,R,Francis Ford Coppola,408035783,1098714,...,0,0,0,0,0,0,0,0,0,0
4,4,tt0110912,Pulp Fiction,1994-10-28,154,USA,R,Quentin Tarantino,222831817,1780147,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
69,94,tt2106476,Jagten,2012-11-22,115,Denmark,R,Thomas Vinterberg,15843274,269616,...,0,0,0,0,0,0,0,0,0,0
70,95,tt0056172,Lawrence of Arabia,1963-10-29,228,UK,PG,David Lean,45710874,261504,...,0,0,0,0,0,0,0,0,0,0
71,96,tt0070735,The Sting,1974-03-21,129,USA,PG,George Roy Hill,156000000,236285,...,0,0,0,0,0,0,0,0,0,0
72,97,tt0082096,Das Boot,1982-03-18,149,Germany,R,Wolfgang Petersen,11487676,226427,...,0,0,0,0,0,0,0,1,0,0
73,99,tt1832382,Jodaeiye Nader az Simin,2011-10-21,123,Iran,PG-13,Asghar Farhadi,22926076,214165,...,0,0,0,0,0,0,0,0,0,0

In [53]:
df.to_csv('clean_movie_data.csv', index=False, encoding='utf-8')
df_one_hot.to_csv('clean_one_hot_data.csv', index=False, encoding='utf-8')